Revit 2026 API

# ApplicationIsPipingAnalysisEnabled Property

---

Checks whether or not piping analysis is enabled, and enable or disable it.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsPipingAnalysisEnabled { get; set; }
```
```vb
Public Property IsPipingAnalysisEnabled As Boolean
	Get
	Set
```
```cpp
public:
property bool IsPipingAnalysisEnabled {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsPipingAnalysisEnabled : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled. |

Enabling piping analysis will not take effect unless the piping discipline is also enabled.

#### Reference

Application Class

Autodesk.Revit.ApplicationServices Namespace